[
  {
    "slug": "agent-safety-profiles",
    "title": "Agent Safety Profiles in OpenClaw: Fast Automation Without Losing Control",
    "date": "February 27, 2026",
    "summary": "How to tune sandbox and approval settings into practical safety profiles so your OpenClaw automations stay fast without becoming risky.",
    "file": "2026-02-27-agent-safety-profiles.md"
  },
  {
    "slug": "multi-model-workflows",
    "title": "Multi-Model Workflows in OpenClaw: Picking the Right Brain for Every Task",
    "date": "February 24, 2026",
    "summary": "How to use different models across sessions, sub-agents, and cron jobs to optimize for speed, cost, and quality.",
    "file": "2026-02-24-multi-model-workflows.md"
  },
  {
    "slug": "voice-tts-agent",
    "title": "Give Your Agent a Voice: Text-to-Speech in OpenClaw",
    "date": "February 23, 2026",
    "summary": "How OpenClaw's built-in TTS tool lets your agent speak out loud — for storytelling, morning briefings, accessibility, and more.",
    "file": "2026-02-23-voice-tts-agent.md"
  },
  {
    "slug": "heartbeats-proactive-agents",
    "title": "Heartbeats in OpenClaw: Building a Proactive Agent That Checks In",
    "date": "February 22, 2026",
    "summary": "How OpenClaw's heartbeat system lets your agent wake up periodically, check on things that matter, and stay quiet when nothing needs attention.",
    "file": "2026-02-22-heartbeats-proactive-agents.md"
  },
  {
    "slug": "node-pairing-device-control",
    "title": "Node Pairing in OpenClaw: Control Your Devices From Anywhere",
    "date": "February 21, 2026",
    "summary": "How OpenClaw's node pairing system lets your agent run commands, snap photos, grab screenshots, and send notifications across all your devices.",
    "file": "2026-02-21-node-pairing-device-control.md"
  },
  {
    "slug": "sub-agents-background-tasks",
    "title": "Sub-Agents in OpenClaw: Background Tasks That Think for Themselves",
    "date": "February 20, 2026",
    "summary": "How to use OpenClaw's sub-agent system to spawn parallel background tasks, delegate complex work, and orchestrate multi-step workflows.",
    "file": "2026-02-20-sub-agents-background-tasks.md"
  },
  {
    "slug": "agent-memory-persistence",
    "title": "Agent Memory in OpenClaw: How Your AI Remembers You",
    "date": "February 19, 2026",
    "summary": "How OpenClaw's file-based memory system gives your agent persistent context across sessions — daily notes, long-term memory, and semantic search.",
    "file": "2026-02-19-agent-memory-persistence.md"
  },
  {
    "slug": "browser-control-openclaw",
    "title": "Browser Control in OpenClaw: Give Your Agent Eyes on the Web",
    "date": "February 19, 2026",
    "summary": "How to use OpenClaw's built-in browser control to let your agent open pages, click, type, screenshot, and automate web tasks.",
    "file": "2026-02-19-browser-control-openclaw.md"
  },
  {
    "slug": "cron-jobs-scheduled-agents",
    "title": "Cron Jobs and Scheduled Agents in OpenClaw",
    "date": "February 18, 2026",
    "summary": "How to use OpenClaw's built-in cron system for reminders, periodic checks, and autonomous background tasks.",
    "file": "2026-02-18-cron-jobs-scheduled-agents.md"
  },
  {
    "slug": "custom-skills-openclaw",
    "title": "Custom Skills in OpenClaw: Teach Your Agent New Tricks",
    "date": "February 18, 2026",
    "summary": "How to create, structure, and load custom skills so your OpenClaw agent can follow your exact workflows.",
    "file": "2026-02-18-custom-skills-openclaw.md"
  },
  {
    "slug": "discord-bots-openclaw",
    "title": "Discord Bots in OpenClaw: A Friendly Beginner's Guide",
    "date": "February 11, 2026",
    "summary": "A beginner-friendly walkthrough of Discord basics, why bots are easy there, and how to wire a Discord bot into OpenClaw.",
    "file": "2026-02-11-discord-bots-openclaw.md"
  },
  {
    "slug": "whatsapp-vs-telegram-agents",
    "title": "WhatsApp vs Telegram: Understanding Multi-Agent Architecture in OpenClaw",
    "date": "February 8, 2026",
    "summary": "How multi-agent setups differ across WhatsApp and Telegram, with practical guidance for choosing the right architecture.",
    "file": "2026-02-08-whatsapp-vs-telegram-agents.md"
  }
]
